tutorial/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

backgroundMesh
{
    xMin  -820;//-5400; // L = 480
    xMax   485;//5400;
    yMin  -390;//-4995; // L = 420
    yMax   405;//4995;
    zMin     0; // L = 150
    zMax   150;//990;
    xCells  87;//50;//108;//720;
    yCells  53;//50;//100;//666;
    zCells  10;//10;//20;//66;
}

convertToMeters 1;

vertices
(
    (-820 -390 0)
    (485 -390 0)
    (485 405 0)
    (-820 405 0)

    (-820 -390 150)
    (485 -390 150)
    (485 405 150)
    (-820 405 150)
);

blocks
(
    hex (0 1 2 3 4 5 6 7)
    (
        87
        53
        10
    )
    simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    west
    {
        type patch;
        faces
        (
            (0 3 7 4)
        );
    }

    east
    {
        type patch;
        faces
        (
            (1 5 6 2)
        );
    }
    
    north
    {
        type patch;
        faces
        (
            (3 2 6 7)
        );
    }  
    
    south
    {
        type patch;
        faces
        (
            (0 4 5 1)
        );
    }        

    ground
    {
        type wall;
        faces
        (
            (0 1 2 3)
        );
    }

    top
    {
        type patch;
        faces
        (
            (4 7 6 5)
        );
    }

);

mergePatchPairs
(
);

// ************************************************************************* //
