tutorial/0/p
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  dev                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform 1e5;

boundaryField
{
    "(buildings|ground)" 
    {
        type            calculated;
        value           $internalField;
    }

    east 
    {
        type            calculated;
        value           $internalField;
    }

    west
    {
        type            calculated;
        value           $internalField;
    }

    "(north|south|top)"
    {
        type            slip;
    }

}

// ************************************************************************* //
