tutorial/0/p_rgh
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p_rgh;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform 1e5;

boundaryField
{
    east
    {
        type fixedFluxPressure;
        rho rho;
        value uniform 1e5;
    }

    west
    {
        type            totalPressure;
        p0              uniform 1e5;
        gamma           1.4;
        value           uniform 1e5;
    }

    ground
    {
        type fixedFluxPressure;
        rho rho;
        value uniform 1e5;
    }

    "(north|south|top)"
    {
        type            slip;
    }

    "buildings"
    {
        type fixedFluxPressure;
        rho rho;
        value uniform 1e5;
    }
}

// ************************************************************************* //
