tutorial/0/T
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      T;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 1 0 0 0];

internalField     uniform 294.32;

boundaryField
{
    "buildings"
    {
        type            fixedValue;
        value           uniform 293.92;
    }

    ground
    {
        type            fixedValue;
        value           uniform 288.15;
    }

    "(north|south|top)"
    {
        type            slip;
    }

    east
    {
        type            uniformFixedValue;
	uniformValue	table
	(
(0	294.32)
(300	294.04)
(600	294.13)
(900	294.11)
(1200	293.97)
(1500	293.99)
(1800	294.01)
(2100	294.06)
(2400	294.11)
(2700	294.09)
(3000	293.9)
(3300	293.78)
(3600	293.75)
(3900	293.9)
(4200	293.75)
(4500	293.68)
(4800	293.54)
(5100	293.56)
(5400	293.47)
(5700	293.44)
(6000	293.37)
(6300	293.25)
(6600	293.25)
(6900	293.16)
(7200	293.13)
(7500	293.04)
(7800	293.06)
(8100	293.13)
(8400	293.16)
(8700	293.16)
(9000	293.01)
(9300	293.01)
(9600	292.99)
(9900	293.04)
(10200	292.97)
(10500	292.9)
(10800	292.9)
(11100	292.97)
(11400	292.9)
(11700	292.82)
(12000	292.78)
(12300	292.75)
(12600	292.78)
(12900	292.82)
(13200	292.87)
(13500	292.87)
(13800	292.92)
(14100	292.97)
(14400	293.01)
(14700	293.04)
(15000	293.11)
(15300	293.16)
(15600	293.16)
(15900	293.09)
(16200	293.09)
(16500	293.04)
(16800	292.99)
(17100	293.04)
(17400	293.04)
(17700	292.99)
(18000	293.01)
(18300	293.01)
(18600	292.99)
(18900	292.99)
(19200	292.99)
(19500	292.9)
(19800	292.87)
(20100	292.8)
(20400	292.8)
(20700	292.73)
(21000	292.71)
(21300	292.71)
(21600	292.63)

	);
      
    }

    west
    {
       type inletOutlet;
       value uniform 294.32;
       inletValue uniform 294.32;
    }
}


// ************************************************************************* //
