tutorial/0/epsilon
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      epsilon;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -3 0 0 0 0];

internalField   uniform 0.02;

boundaryField
{
    "buildings"
    {
        type            epsilonWallFunction;
        Cmu             0.09;
        kappa           0.4;
        E               9.8;
        value           uniform 0.02;
    }

    ground
    {
        type            zeroGradient;
    }

    "(north|south|top)"
    {
        type            slip;
    }

    east
    {
        type            atmBoundaryLayerInletEpsilon;
        #include        "include/ABLConditions";
    }

    west
    {
        type            inletOutlet;
        inletValue      uniform 0.02;
        value           uniform 0.02;
    }
}


// ************************************************************************* //
