tutorial/0/k
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      k;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 1.3;

boundaryField
{
    "buildings"
    {
        type            kqRWallFunction;
        value           $internalField;
    }

    ground
    {
        type            zeroGradient;
    }

    "(north|south|top)"
    {
        type            slip;
    }

    east
    {
        type            atmBoundaryLayerInletK;
        #include        "include/ABLConditions";
    }

    west
    {
        type            inletOutlet;
        inletValue      uniform 1.3;
        value           $internalField;
    }
}


// ************************************************************************* //
