tutorial/0/nut
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      nut;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -1 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    east
    {
        type            calculated;
        value           uniform 0;
    }

    west
    {
        type            calculated;
	value           uniform 0;
    }

    ground
    {
        type            nutkAtmRoughWallFunction;
        z0              uniform 2;
        value           uniform 0.0;
    }

    "buildings"
    {
        type            nutkWallFunction;
        value           uniform 0;
    }

    "(north|south|top)"
    {
        type            slip;
    }
}


// ************************************************************************* //
